//
//  FactsTestData.swift
//  Avocados
//
//  Created by SHIRAISHI HIROYUKI on 2023/11/12.
//

import Foundation

func FactTestDatas() -> FactDatas {
    return [
        FactData(
          image: "avocado-fact-1",
          content: "アボカドの木には、果実が木の上で熟すことを防ぐ酵素が含まれているため、農家は果実が成熟した後、最長 7 か月間、木を貯蔵装置として使用できます"
        ),
        FactData(
          image: "avocado-fact-2",
          content: "アボカド 1 食分 (1/4 または 50 g) に、健康的な脂肪、繊維、葉酸、ナイアシン、ビタミン C、B5、E、K、カリウム、抗酸化物質が豊富に含まれているのですから、これほど多くの健康上の利点があるのも不思議ではありません"
        ),
        FactData(
          image: "avocado-fact-3",
          content: "アボカドの大きさは、果実の品質や熟度の段階を示すものではありません。アボカドの種は実際には果物と一緒に成長するため、種と果物の比率は常に同じに近くなります"
        ),
        FactData(
          image: "avocado-fact-4",
          content: "アボカドの皮と種は犬や猫にとって非常に有害です。ペットはアボカドの中身を食べることができますが、皮は猫や犬にとって有毒である可能性があります"
        ),
        FactData(
          image: "avocado-fact-5",
          content: "アボカドはすべて手摘みで収穫されます。 16フィートのポールを使って、高いところにある果実に届くように収穫します。人件費が高いため、他の果物に比べて高価です"
        ),
        FactData(
          image: "avocado-fact-6",
          content: "アボカドは愛の象徴です。アステカ文化では、アボカドは愛の象徴です。なぜ？彼らは自家受粉することができないため、パートナーが必要です。ペアで成長することもあります"
        ),
        FactData(
          image: "avocado-fact-7",
          content: "アボカドを早く追熟させる裏ワザがあります。バナナを1〜2本と一緒に茶色の紙袋に入れます。バナナは、果物の熟成を助ける天然の植物ホルモンであるエチレンガスを放出します"
        ),
        FactData(
          image: "avocado-fact-8",
          content: "アボカドを甘い食べ物に変えるおいしい方法。アボカドをサンドイッチやサラダの風味豊かな追加物としてだけ考えないでください。ブラジル人は実際にアイスクリームにアボカドを加えます"
        ),
        FactData(
          image: "avocado-fact-9",
          content: "アボカドは本当に古いです。アボカドは本当に長い間存在していることをご存知ですか?実際、アボカドの起源は紀元前 8,000 年に遡るという証拠があります"
        ),
        FactData(
          image: "avocado-fact-10",
          content: "アボカドに関する楽しい事実。アボカドは果物だということをご存知ですか？アボカドは決して甘くありませんが、しっかりとフルーツサラダの野菜の仲間に分類されます"
        ),
        FactData(
          image: "avocado-fact-11",
          content: "アボカドには4グラムのタンパク質が含まれており、タンパク質含有量が最も高い果物です。アボカドにはカリウム、食物繊維、抗酸化物質も豊富に含まれています"
        ),
        FactData(
          image: "avocado-fact-12",
          content: "知っていましたか？調査対象となった医療専門家の96%は、果物や野菜の摂取量を増やすことを勧める際にアボカドを推奨しています"
        )
    ]
}
